Тестовая_база_ERP_14/src/InformationRegisters/ОперацииКСозданиюСменныхЗаданий/ОперацииКСозданиюСменныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперацииКСозданиюСменныхЗаданий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения</name>
    <comment>Реквизит является справочным, так как рассчитывается с округлением на основании времени штучного и времени ПЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </resources>
  <resources>
    <name>МожноНазначать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НужноНазначать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НарушенПорядокНазначения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующейОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменноеЗадание</name>
    <type>
      <types>DocumentRef.СменноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.ТехнологическиеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОперации</name>
    <comment>Уникальный идентификатор операции в маршрутной карте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Бригады</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабочегоЦентра</name>
    <type>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначатьНеРанее</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ОчередьПроизводственныхОпераций/ОчередьПроизводственныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьПроизводственныхОпераций</name>
  <resources>
    <name>Запланировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Создано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОжиданиеПредшествующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачатыПредшествующие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МожноВыполнять</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выполняется</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТребуетПовторения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пропущено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>CatalogRef.МаршрутныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентМаршрутнойКарты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <comment>Суммарное время выполнения по данным МК и производственных операций. Реквизит является справочным, так как рассчитывается с округлением на основании времени штучного и времени ПЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияНормативное</name>
    <comment>Время выполнения по данным МК. Реквизит является справочным, так как рассчитывается с округлением на основании времени штучного и времени ПЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующейОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.ТехнологическиеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОперации</name>
    <comment>Уникальный идентификатор операции в маршрутной карте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/СтатусыСменныхЗаданий/СтатусыСменныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСменныхЗаданий</name>
  <enumValues>
    <name>Формируется</name>
  </enumValues>
  <enumValues>
    <name>Сформировано</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/СменноеЗадание/СменноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СменноеЗадание</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСменныхЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.ПроизводственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Бригады</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Catalogs/ТехнологическиеОперации/ТехнологическиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеОперации</name>
  <owners>Catalog.МаршрутныеКарты</owners>
  <attributes>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующейОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитВложенныйМаршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВложенныйМаршрут</name>
    <type>
      <types>CatalogRef.МаршрутныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучноеЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНаладки</name>
    <type>
      <types>CatalogRef.ВариантыНаладки</types>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Непрерывная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Уникальный идентификатор операции в маршрутной карте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПередаточнаяПартия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыТехнологическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноПовторить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноПропустить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВспомогательныеРабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативыВидаОперации</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/InformationRegisters/ОперацииКСозданиюСменныхЗаданий/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОтключенКонтроль = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.КлючНеКонтролироватьДанныеПриЗаписи();
	
	Если ЭтотОбъект.Количество() > 0
		И НЕ ДополнительныеСвойства.Свойство(ОтключенКонтроль) Тогда
		
		КонтрольНазначенияОпераций(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КонтрольНазначенияОпераций(Отказ)
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	NULL                     КАК Этап,
		|	NULL                     КАК Операция,
		|	Операции.СменноеЗадание  КАК СменноеЗадание,
		|	NULL                     КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА НЕ Задания.Проведен
		|			ТОГДА ""ЗаданиеНеПроведено""
		|		ИНАЧЕ ""СтатусЗаданияНеФормируется""
		|	КОНЕЦ                    КАК КодОшибки
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СменноеЗадание КАК Задания
		|		ПО Операции.СменноеЗадание = Задания.Ссылка
		|ГДЕ
		|	#ТекстДополнительныеУсловия
		|	И (НЕ Задания.Проведен
		|			ИЛИ Задания.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСменныхЗаданий.Формируется))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	NULL                  КАК Этап,
		|	Операции.Операция     КАК Операция,
		|	NULL                  КАК СменноеЗадание,
		|	NULL                  КАК Исполнитель,
		|	""НекорректныйВидРЦ"" КАК КодОшибки
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО Операции.Операция = ТехнологическиеОперации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеЦентры КАК РабочиеЦентры
		|		ПО (ТехнологическиеОперации.РабочийЦентр = РабочиеЦентры.Ссылка)
		|ГДЕ
		|	#ТекстДополнительныеУсловия
		|	И Операции.ВидРабочегоЦентра <> ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)
		|	И НЕ ТехнологическиеОперации.РабочийЦентр В (ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
		|	И Операции.ВидРабочегоЦентра <> ВЫБОР
		|			КОГДА ТехнологическиеОперации.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
		|				ТОГДА РабочиеЦентры.ВидРабочегоЦентра
		|			ИНАЧЕ ТехнологическиеОперации.РабочийЦентр
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Операции.Этап                КАК Этап,
		|	Операции.Операция            КАК Операция,
		|	NULL                         КАК СменноеЗадание,
		|	NULL                         КАК Исполнитель,
		|	""ПревышениеПланКоличества"" КАК КодОшибки
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПроизводственныхОпераций КАК Очередь
		|		ПО Операции.Подразделение = Очередь.Подразделение
		|			И Операции.Этап = Очередь.Этап
		|			И Операции.Операция = Очередь.Операция
		|			И Операции.ИдентификаторОперации = Очередь.ИдентификаторОперации
		|ГДЕ
		|	(Операции.Этап, Операции.Операция) В 
		|		(ВЫБРАТЬ
		|			Операции.Этап,
		|			Операции.Операция
		|		 ИЗ
		|			РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
		|		 ГДЕ
		|			#ТекстДополнительныеУсловия)
		|	И Операции.СменноеЗадание <> ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)
		|
	 	|СГРУППИРОВАТЬ ПО
	 	|	Операции.Этап,
	 	|	Операции.Операция
		|
		|ИМЕЮЩИЕ
		|	СУММА(Операции.Количество) > (МАКСИМУМ(Очередь.Запланировано) + МАКСИМУМ(Очередь.ТребуетПовторения) - МАКСИМУМ(Очередь.Создано))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	NULL                          КАК Этап,
		|	Операции.Операция             КАК Операция,
		|	NULL                          КАК СменноеЗадание,
		|	Бригады.Ссылка                КАК Исполнитель,
		|	""НесоответствиеОрганизации"" КАК КодОшибки
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Бригады КАК Бригады
		|		ПО Операции.Исполнитель = Бригады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|		ПО Операции.Этап = ЭтапПроизводства2_2.Ссылка
		|ГДЕ
		|	#ТекстДополнительныеУсловия
		|	И Операции.Исполнитель ССЫЛКА Справочник.Бригады
		|	И Операции.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка)
		|	И Бригады.Организация <> ЭтапПроизводства2_2.Организация";
	
	Запрос = Новый Запрос;
	
	ТекстУсловия = "";
	Для каждого Элемент Из Отбор Цикл
		
		Если НЕ Элемент.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстУсловия = ТекстУсловия	+ " Операции." + Элемент.Имя + " = &" + Элемент.Имя + " И ";
		
		Запрос.УстановитьПараметр(Элемент.Имя, Элемент.Значение);
		
	КонецЦикла;
	ТекстУсловия = ТекстУсловия + "Операции.СменноеЗадание <> ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#ТекстДополнительныеУсловия", ТекстУсловия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = "";
		КлючДанных = Неопределено;
		
		Если Выборка.КодОшибки = "ЗаданиеНеПроведено" Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Документ %1 не проведен.';
											|en = 'Document %1 is not posted.'"), Выборка.СменноеЗадание);
			КлючДанных = Выборка.СменноеЗадание;
			
		ИначеЕсли Выборка.КодОшибки = "СтатусЗаданияНеФормируется" Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Документ %1 не находится в статусе ""Формируется"".';
											|en = 'Document %1 is not in the ""Generating"" status.'"), Выборка.СменноеЗадание);
			КлючДанных = Выборка.СменноеЗадание;
			
		ИначеЕсли Выборка.КодОшибки = "НекорректныйВидРЦ" Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Операция %1 не может быть назначена заданному РЦ (виду РЦ).';
											|en = 'The %1 operation cannot be assigned to the specified work center (work center kind).'"), Выборка.Операция);
			
		ИначеЕсли Выборка.КодОшибки = "ПревышениеПланКоличества" Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Операция %1 %2 назначена в количестве, превышающем запланированное.';
											|en = 'The %1 %2 operation is assigned in the quantity exceeding the planned one.'"),
				Выборка.Операция, Выборка.Этап);
			
		ИначеЕсли Выборка.КодОшибки = "НесоответствиеОрганизации" Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Операция %1 и бригада %2 относятся к различным организациям.';
											|en = 'Operation %1 and team %2 belong to different companies.'"),
				Выборка.Операция, Выборка.Исполнитель);
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				КлючДанных,
				,
				, 
				Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
